# Pandas Datastructure

 (1) Series
 (2) DataFrame
 (3) Index

In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
data=pd.Series([0.2,.4,0.75])
data # wraps both values and index

0    0.20
1    0.40
2    0.75
dtype: float64

In [3]:
data.values # NumPy array

array([0.2 , 0.4 , 0.75])

In [4]:
data.index # arr like obj of type pd.Index

RangeIndex(start=0, stop=3, step=1)

In [5]:
data[1] # accessing elements

0.4

In [6]:
data[1:]

1    0.40
2    0.75
dtype: float64

In [7]:
data=pd.Series([1,2,3,0.5],index=['a','z','q','q'])
data # can explicitly define index

a    1.0
z    2.0
q    3.0
q    0.5
dtype: float64

In [8]:
data['q']

q    3.0
q    0.5
dtype: float64

In [9]:
pd.Series(5,index=[10,20,30,40]) # data can be scalar and repeated 
# to fill the specified index

10    5
20    5
30    5
40    5
dtype: int64

In [10]:
pd.Series({2:'a', 1:'b', 3:'c'}) 
# data can be dict., index defaults to dict. keys

2    a
1    b
3    c
dtype: object

In [11]:
pd.Series({2:'q',3:'w',4:'e'},index=[2,3])
# Series is populated only with explicitly defined keys

2    q
3    w
dtype: object

# Dataframe

In [12]:
population=pd .Series({'Gurgaon':120000,'Delhi':220000,'Mumbai':225000})
area=pd.Series({'Gurgaon':122001,'Delhi':110001,'Mumbai':330001})
states=pd.DataFrame({'Population':population,'Area':area})
states

         Population    Area
Gurgaon      120000  122001
Delhi        220000  110001
Mumbai       225000  330001

In [13]:
states.index

Index(['Gurgaon', 'Delhi', 'Mumbai'], dtype='object')

In [14]:
states.columns #index object holding column values
# DataFrame is generalization of 2-D NumPy arr

Index(['Population', 'Area'], dtype='object')

In [15]:
states['Area']

Gurgaon    122001
Delhi      110001
Mumbai     330001
Name: Area, dtype: int64

In [16]:
data=[ {'a':i,'b':2*i} for i in range(3)]
pd.DataFrame(data) # list of dict. to make df

   a  b
0  0  0
1  1  2
2  2  4

In [17]:
pd.DataFrame(np.random.rand(3,2),columns=['foo','bar'],index=[1,2,3])
# from 2-D arr

        foo       bar
1  0.248190  0.877332
2  0.185395  0.031068
3  0.340658  0.510837

# Index

In [18]:
# immutable array or multi-set

In [19]:
ind=pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [20]:
print("ind[1] :",ind[1])
print("ind[::2] :",ind[::2])
print("size, shape, ndim, dtype :",ind.size,ind.shape,ind.ndim,ind.dtype)

ind[1] : 3
ind[::2] : Int64Index([2, 5, 11], dtype='int64')
size, shape, ndim, dtype : 5 (5,) 1 int64

In [21]:
# index as ordered list
indA=pd.Index([1,3,5,7,11])
indB=pd.Index([2,3,5,7,9])
print('intersection :',indA &indB)
print('union :',indA |indB)
print('symmetric diff. :',indA ^ indB)

intersection : Int64Index([3, 5, 7], dtype='int64')
union : Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
symmetric diff. : Int64Index([1, 2, 9, 11], dtype='int64')

# Data Indexing and Selection

In [22]:
data=pd.Series([0.25,0.75,0.99],index=['a','b','c'])

In [23]:
data['b']

0.75

In [24]:
'a' in data # can use dict. like python expressions

True

In [25]:
data.keys()

Index(['a', 'b', 'c'], dtype='object')

In [26]:
list(data.items())

[('a', 0.25), ('b', 0.75), ('c', 0.99)]

In [27]:
data['d']=9.3 # series can be modified and extended
data

a    0.25
b    0.75
c    0.99
d    9.30
dtype: float64

# Series as 1-D array

In [28]:
print("Slicing :",data['a':'c']) # slicing by explicit idx
print("---")
print("Slice :",data[0:2]) # slicing by implicit idx
print("---")
print("Masking :",data[(data>0.5) & (data<0.8)])
print("---")
print("fancy idx :",data[['a','d']])

Slicing : a    0.25
b    0.75
c    0.99
dtype: float64
---
Slice : a    0.25
b    0.75
dtype: float64
---
Masking : b    0.75
dtype: float64
---
fancy idx : a    0.25
d    9.30
dtype: float64

# Indexers: loc, iloc, and ix

In [29]:
data=pd.Series([12,45,78,90])
print(data.loc[1])# indexing and slicing that always references the explicit index
print(data.loc[1:3])

45
1    45
2    78
3    90
dtype: int64

In [30]:
print(data.iloc[1])# indexing and slicing that always references the implicit index
print(data.iloc[1:3])
# ix, is a hybrid of the two, and for Series objects is equivalent to standard []-based indexing

45
1    45
2    78
dtype: int64

# DataFrame as a dict.

In [31]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [32]:
data['area']
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [33]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

#  DataFrame as 2d arr

In [34]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [35]:
data.T # transpose full df

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [36]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [37]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [38]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [39]:
data.loc[:'Florida',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860

In [40]:
# data.ix[:3,:'pop']

In [41]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [42]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

# Operating on Data in Pandas

# Ufuncs: Index Preservation

In [43]:
rng=np.random.RandomState(41)
ser=pd.Series(rng.randint(0,10,4))
ser

0    0
1    3
2    2
3    0
dtype: int32

In [44]:
df=pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  1  3  9  7
1  5  8  3  3
2  2  6  0  4

In [45]:
np.exp(ser) # Applying a NumPy ufunc on either of these obj.
# the result will be another pandas object with indices preserved.

0     1.000000
1    20.085537
2     7.389056
3     1.000000
dtype: float64

In [46]:
np.sin(df * np.pi/4)

          A             B         C             D
0  0.707107  7.071068e-01  0.707107 -7.071068e-01
1 -0.707107 -2.449294e-16  0.707107  7.071068e-01
2  1.000000 -1.000000e+00  0.000000  1.224647e-16

# Ufuncs: Index Alignment

In [47]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [48]:
population/area # ny item for which one or the other does not
# have an entry is marked with NaN, or "Not a Number"

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [49]:
area.index | population.index # resulting arr. contains union of
# indicies of 2 input arr.

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [50]:
# This index matching is implemented this way for any of Python's
# built-in arithmetic expressions; any missing values are filled
# in with NaN by default

In [51]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [52]:
A.add(B,fill_value=0) # allow optional explicit spec. to fill values
# of any element that might be missing

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [53]:
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=['A','B'])
A

    A   B
0   9  19
1  11  17

In [54]:
B=pd.DataFrame(rng.randint(1,10,(3,3)),columns=list('BAC'))
B

   B  A  C
0  6  3  2
1  6  4  3
2  5  2  3

In [55]:
A+B

      A     B   C
0  12.0  25.0 NaN
1  15.0  23.0 NaN
2   NaN   NaN NaN

In [56]:
fill=A.stack().mean()

In [57]:
A.add(B,fill_value=fill)

      A     B     C
0  12.0  25.0  16.0
1  15.0  23.0  17.0
2  16.0  19.0  17.0

In [58]:
fill

14.0

# Ufuncs: Operations Between DataFrame and Series

In [59]:
A=rng.randint(10,size=(3,4))
df=pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  3  4  5  4
1  5  7  6  2
2  4  5  8  4

In [60]:
df-df.iloc[0] # In Pandas, the convention similarly operates
# row-wise by default

   Q  R  S  T
0  0  0  0  0
1  2  3  1 -2
2  1  1  3  0

In [61]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0 -1  0  1  0
1 -2  0 -1 -5
2 -1  0  3 -1

# Handling Missing Data

In [62]:
val=np.array([1,np.nan,3,4])
val.dtype

dtype('float64')

In [63]:
val.sum(),val.min(),val.max() # doing anything with nan results in nan

(nan, nan, nan)

In [64]:
np.nansum(val),np.nanmin(val),np.nanmax(val) # ignore nan value

(8.0, 1.0, 4.0)

# Detecting Null Values

In [65]:
data=pd.Series([1,np.nan,'hello',None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [66]:
data[data.notnull()]

0        1
2    hello
dtype: object

# Dropping NUll Values

In [67]:
data.dropna()

0        1
2    hello
dtype: object

In [68]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [69]:
df.dropna() # by default will drop rows

     0    1  2
1  2.0  3.0  5

In [70]:
df.dropna(axis=1) # will drop column

   2
0  2
1  5
2  6

In [71]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [72]:
df.dropna(axis=1,how='all') # Drop that column whose all rows are null

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [73]:
df.dropna(axis=1,how='any') # drop that column in which atleast one row is null

   2
0  2
1  5
2  6

In [74]:
df.dropna(axis=0,thresh=3) # thresh defines min. no. of non null values to be kept

     0    1  2   3
1  2.0  3.0  5 NaN

# Filling null values

In [75]:
data = pd.Series([1,None,2,None,3],index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [76]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [77]:
data.fillna(method='ffill') # forward fill

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [78]:
data.fillna(method='bfill') # backward fill

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [79]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [80]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# Hierarchical Indexing

# Bad Way

In [81]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

#  Better Way: Pandas MultiIndex

In [82]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [83]:
pop=pop.reindex(index) # reindexing with 2 index and 1 data
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [84]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

# MultiIndex as extra dim

In [85]:
pop_df=pop.unstack() # unstack will convert multiple indexed series into df
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [86]:
pop_df.stack() # opposite of unstack

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [87]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [88]:
f_u18=pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

# Methods for multi-indexed Creation

In [89]:
df=pd.DataFrame(np.random.rand(4,2), index=[['a','b','a','b'],[1,2,1,2]],
               columns=['data1','data2'])
df # The most straightforward way to construct a multiply indexed Series or DataFrame is to simply pass a list of two or more index arrays to the constructor

        data1     data2
a 1  0.394364  0.940048
b 2  0.356286  0.570596
a 1  0.354573  0.478836
b 2  0.176603  0.442269

In [90]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data) # passing a dict. with approp. tuple, Pandas will recoginize it
# and use multiIndex by default

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

# Explicit MultiIndex constructor

In [91]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]]) # from list of arrays

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [92]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)]) # from list of tuples

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [93]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]]) # from cartesian prod.

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [94]:
# # levels (a list of lists containing available index values for each level) and labels (a list of lists that reference these labels):
# pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
#               labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

# MultiIndex level names

In [95]:
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

# MultiIndex in Columns

In [96]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.7  46.0  37.2  31.0  37.0
     2      38.0  36.9  34.0  38.0  51.0  35.7
2014 1      31.0  36.0  55.0  37.1  28.0  38.6
     2      50.0  37.9  39.0  38.5  53.0  37.7

In [97]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      46.0  37.2
     2      34.0  38.0
2014 1      55.0  37.1
     2      39.0  38.5

# Indexing and Slicing a MultiIndex

In [98]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [99]:
pop['California'] # partial slicing only iff lower index is sorted

year
2000    33871648
2010    37253956
dtype: int64

In [100]:
pop.loc['California':'Texas']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [101]:
pop[:,2000] # With sorted indices, partial indexing can be performed on lower levels by passing an empty slice in the first index

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [102]:
pop[pop>22000000] # Selection based on boolean mask

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [103]:
pop[['California','Texas']] # Selection based on fancy indexing

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

# Multiply indexed DataFrame

In [104]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.7  46.0  37.2  31.0  37.0
     2      38.0  36.9  34.0  38.0  51.0  35.7
2014 1      31.0  36.0  55.0  37.1  28.0  38.6
     2      50.0  37.9  39.0  38.5  53.0  37.7

In [105]:
health_data['Guido','HR']

year  visit
2013  1        46.0
      2        34.0
2014  1        55.0
      2        39.0
Name: (Guido, HR), dtype: float64

In [106]:
health_data.loc[:2013,:]

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.7  46.0  37.2  31.0  37.0
     2      38.0  36.9  34.0  38.0  51.0  35.7

In [107]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        29.0
      2        38.0
2014  1        31.0
      2        50.0
Name: (Bob, HR), dtype: float64

In [108]:
health_data.loc[(:,1),(:,'HR')]

SyntaxError: invalid syntax (<ipython-input-108-2d8e6b30864e>, line 1)

In [109]:
# Better way is to use index slice
idx=pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      29.0  46.0  31.0
2014 1      31.0  55.0  28.0

# Rearranging Multi-indices

In [110]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data # unsorted index(lexical order)
# can use sort_index(),sort_level()

char  int
a     1      0.662256
      2      0.770397
c     1      0.224840
      2      0.502500
b     1      0.151913
      2      0.945176
dtype: float64

In [111]:
data=data.sort_index()
data

char  int
a     1      0.662256
      2      0.770397
b     1      0.151913
      2      0.945176
c     1      0.224840
      2      0.502500
dtype: float64

# Stacking and Unstacking indicies

In [112]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [113]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [114]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

# index setting and resetting

In [115]:
pop_flat=pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [116]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

# Data Aggregation on Multi-Indices

In [117]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  36.7  46.0  37.2  31.0  37.0
     2      38.0  36.9  34.0  38.0  51.0  35.7
2014 1      31.0  36.0  55.0  37.1  28.0  38.6
     2      50.0  37.9  39.0  38.5  53.0  37.7

In [118]:
data_mean=health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     33.5  36.80  40.0  37.6  41.0  36.35
2014     40.5  36.95  47.0  37.8  40.5  38.15

In [119]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  38.166667  36.916667
2014  42.666667  37.633333

# Combining Dataset: Concat n append

In [120]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [121]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [122]:
pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False,
          copy=True)

NameError: name 'objs' is not defined

In [ ]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

In [ ]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

In [123]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis='columns')")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis='columns')
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

# Duplicate Indicies
padas preserve duplicate indicies during concatenation

In [124]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [125]:
# verifing integrity tag helps in maintaining integrity i.e. no overlapping

In [126]:
# ignore index flag will create a new int. index for the resulting Series

In [127]:
display('x', 'y', 'pd.concat([x, y], ignore_index=True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

# Concatenation with Joins

In [128]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [129]:
# To change this, we can specify one of several options for the join and join_axes parameters of the concatenate function. By default, the join is a union of the input columns (join='outer'), but we can change this to an intersection of the columns using join='inner':

In [130]:
display('df5', 'df6',
        "pd.concat([df5, df6], join='inner')")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

# append() method

In [131]:
display('df1','df2','df1.append(df2)')

NameError: name 'df1' is not defined

NameError: name 'df1' is not defined

# Relational Algebra

In [132]:
# The pd.merge() function implements a number of types of joins: the one-to-one, many-to-one, and many-to-many joins. All three types of joins are accessed via an identical call to the pd.merge() interface

In [133]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [134]:
df3 = pd.merge(df1, df2) # one to one join
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [135]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)') # many to one

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [136]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)") # many to many

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [137]:
# using on keyword

In [138]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [139]:
#  thr left_on and right_on keyword

In [140]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [141]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [142]:
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [143]:
# X---------------------------------------------------------------X

# Aggregation and Grouping

In [144]:
## Planets dataset Seaborn

In [147]:
import seaborn as sns
planets=sns.load_dataset('planets')
planets.shape

(1035, 6)

In [148]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

# Simple Aggregation in Pandas

In [149]:
planets.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [154]:
# planets.mean(axis=1)
planets.mean(axis='columns')
# All aggregation method of numpy will work in pandas series and df

0       472.160000
1       588.586800
2       559.488000
3       492.810000
4       531.238000
           ...
1030    545.735377
1031    539.653966
1032    546.297881
1033    576.531271
1034    568.296939
Length: 1035, dtype: float64

In [155]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

# GroupBy:Split,Apply,Combine

In [156]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [158]:
df.groupby('key')

In [159]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [164]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [170]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

# Aggregate,filter,transform,apply

In [171]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

## Aggregation

In [173]:
df.groupby('key').aggregate(['min',np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [175]:
df.groupby('key').aggregate({'data1':min,'data2':max})

     data1  data2
key
A        0      5
B        1      7
C        2      9

## Filtering

In [178]:
def filter_fun(x):
    return x['data2'].std()>4
df.groupby('key').filter(filter_fun)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

## Transformation